nakhonthai/ESP32IGate/src/main.cpp
unsigned long timeSec;
void loop()
{
    vTaskDelay(5 / portTICK_PERIOD_MS);
#ifdef BLUETOOTH
    if (config.bt_master)
        Bluetooth();
#endif

#ifdef WX
    if (config.wx_en)
        getCSV2Wx();
#endif

    if (digitalRead(0) == LOW)
    {
        btn_count++;
        if (btn_count > 1000) // Push BOOT 10sec
        {
            digitalWrite(LED_PIN, HIGH);
            digitalWrite(LED_TX_PIN, HIGH);
        }
    }
    else
    {
        if (btn_count > 0)
        {
            // Serial.printf("btn_count=%dms\n", btn_count * 10);
            if (btn_count > 1000) // Push BOOT 10sec to Factory Default
            {
                // digitalWrite(LED_RX, LOW);
                // digitalWrite(LED_TX, LOW);
                defaultConfig();
                Serial.println("SYSTEM REBOOT NOW!");
                esp_restart();
            }
            else
            {
                showDisp = true;
                timeSec = timeHalfSec = millis();
                // if (oledSleepTimeout > 0)
                //{
                curTab++;
                if (curTab > 3)
                    curTab = 0;
                //}
            }
            btn_count = 0;
        }
    }

#ifdef OLED
    // Popup Display
    if (config.oled_enable == true)
    {
        if (dispBuffer.getCount() > 0)
        {
            if (millis() > timeHalfSec)
            {
                char tnc2[300];
                dispBuffer.pop(&tnc2);
                dispWindow(String(tnc2), 0, false);
                timeHalfSec = millis() + (config.dispDelay * 1000);
                oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            }
        }
        else
        {
            // Sleep display
            if (millis() > timeHalfSec)
            {
                if (millis() > timeSec && timeHalfSec > 0)
                {
                    timeSec = millis() + 10000;
                    showDisp = true;
                    // timeHalfSec = 0;
                    // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
                }
                else
                {
                    if (millis() > oledSleepTimeout && oledSleepTimeout > 0)
                    {
                        showDisp = false;
                        timeHalfSec = 0;
                        oledSleepTimeout = 0;
                        display.clearDisplay();
                        display.display();
                    }
                }
            }
        }

        if (showDisp)
        {
            showDisp = false;
            timeHalfSec = millis();
            // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            switch (curTab)
            {
            case 0:
                statisticsDisp();
                timeSec = millis() + 10000;
                break;
            case 1:
                pkgLastDisp();
                timeSec = millis() + 10000;
                break;
            case 2:
                pkgCountDisp();
                timeSec = millis() + 10000;
                break;
            case 3:
                systemDisp();
                break;
            }
        }
    }
#endif

    // Tick one secound
    if (millis() > timeCheck)
    {
        timeCheck = millis() + 10000;
        if (ESP.getFreeHeap() < 60000)
            esp_restart();
        // Serial.println(String(ESP.getFreeHeap()));
    }
#ifdef SA818
    // if (SerialRF.available())
    // {
    //     Serial.print(Serial.readString());
    // }
#endif
    if (AFSKInitAct == true)
    {
#ifdef SA818
        AFSK_Poll(true, config.rf_power);
#else
        AFSK_Poll(false, LOW);
#endif
    }
}

String sendIsAckMsg(String toCallSign, int msgId)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    strcpy(&call[0], toCallSign.c_str());
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;
    memset(&str[0], 0, 300);

    sprintf(str, "%s-%d>APE32I%s::%s:ack%d", config.aprs_mycall, config.aprs_ssid, VERSION, call, msgId);
    //	client.println(str);
    return String(str);
}

void sendIsPkg(char *raw)
{
    char str[300];
    sprintf(str, "%s-%d>APE32I%s:%s", config.aprs_mycall, config.aprs_ssid, VERSION, raw);
    // client.println(str);
    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    if (config.digi_en)
        pkgTxPush(str, strlen(str), 0);
}

void sendIsPkgMsg(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.aprs_ssid == 0)
        sprintf(call, "%s", config.aprs_mycall);
    else
        sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.aprs_ssid == 0)
        sprintf(str, "%s>APE32I::%s:%s", config.aprs_mycall, call, raw);
    else
        sprintf(str, "%s-%d>APE32I::%s:%s", config.aprs_mycall, config.aprs_ssid, call, raw);

    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    // if (config.tnc && config.tnc_digi)
    //     pkgTxUpdate(str, 0);
    // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
}

void sendTelemetry_0(char *raw, bool header)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.tlm0_ssid == 0)
        sprintf(call, "%s", config.tlm0_mycall);
    else
        sprintf(call, "%s-%d", config.tlm0_mycall, config.tlm0_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (header)
    {
        if (config.tlm0_ssid == 0){
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32I-%d::%s:%s", config.tlm0_mycall,config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s>APE32I::%s:%s", config.tlm0_mycall, call, raw);
            }
            else
            {
                sprintf(str, "%s>APE32I,%s::%s:%s", config.tlm0_mycall,getPath(config.tlm0_path).c_str(), call, raw);
            }
        }else{
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32I-%d::%s:%s", config.tlm0_mycall, config.tlm0_ssid,config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s-%d>APE32I::%s:%s", config.tlm0_mycall, config.tlm0_ssid, call, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32I,%s::%s:%s", config.tlm0_mycall, config.tlm0_ssid,getPath(config.tlm0_path).c_str(),config.tlm0_path, call, raw);
            }
        }
    }
    else
    {
        if (config.tlm0_ssid == 0){
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32I-%d:%s", config.tlm0_mycall,config.tlm0_path, raw);
                else
                    sprintf(str, "%s>APE32I:%s", config.tlm0_mycall, raw);
            }
            else
            {
                sprintf(str, "%s>APE32I,%s:%s", config.tlm0_mycall,getPath(config.tlm0_path).c_str(), raw);
            }
        }else{
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32I-%d:%s", config.tlm0_mycall, config.tlm0_ssid,config.tlm0_path, raw);
                else
                    sprintf(str, "%s-%d>APE32I:%s", config.tlm0_mycall, config.tlm0_ssid, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32I,%s:%s", config.tlm0_mycall, config.tlm0_ssid,getPath(config.tlm0_path).c_str(),config.tlm0_path, raw);
            }
        }
    }

    if (config.tlm0_2rf)
    { // TLM SEND TO RF
        // char *rawP = (char *)malloc(rawData.length());
        //  rawData.toCharArray(rawP, rawData.length());
        // memcpy(rawP, rawData.c_str(), rawData.length());
        pkgTxPush(str, strlen(str), 0);
        // pushTxDisp(TXCH_RF, "TX DIGI POS", sts);
        // free(rawP);
    }
    if (config.tlm0_2inet)
    { // TLM SEND TO APRS-IS
        if (aprsClient.connected())
        {
            status.txCount++;
            aprsClient.printf("%s\r\n", str); // Send packet to Inet
            // pushTxDisp(TXCH_TCP, "TX DIGI POS", sts);
        }
    }
}

