nakhonthai/ESP32IGate/src/main.cpp
RTC_IRAM_ATTR statusType statOld;
uint8_t getSensor(int ch)
{
    int val = 0;
    switch (ch)
    {
    case 0: // none
        val = 0;
        break;
    case 1: // allCount
        val = status.allCount - statOld.allCount;
        statOld.allCount = status.allCount;
        break;
    case 2: // rf2inet
        val = status.rf2inet - statOld.rf2inet;
        statOld.rf2inet = status.rf2inet;
        break;
    case 3: // inet2rf
        val = status.inet2rf - statOld.inet2rf;
        statOld.inet2rf = status.inet2rf;
        break;
    case 4: // digi
        val = status.digiCount - statOld.digiCount;
        statOld.digiCount = status.digiCount;
        break;
    case 5: // Drop
        val = status.dropCount - statOld.dropCount;
        statOld.dropCount = status.dropCount;
        break;
    }
    if (val < 0)
        val = 0;
    return val;
}

bool getBits(int ch)
{
    bool val = false;
    switch (ch)
    {
    case 0: // none
        val = 0;
        break;
    case 1: // IGATE Enable
        val = config.igate_en;
        break;
    case 2: // DIGI Enable
        val = config.digi_en;
        break;
    case 3: // WX Enable
        val = config.wx_en;
        break;
    case 4: // Sat Enable
        val = 0;
        break;
    case 5: // APRS-IS Status
        if (aprsClient.connected())
            val = 1;
        break;
    case 6: // VPN Status
        val = wireguard_active();
        break;
    case 7: // 4G LTE
        val = 0;
        break;
    case 8: // MQTT
        val = 0;
        break;
    }
    return val;
}

void getTelemetry_0()
{
    systemTLM.A1 = getSensor(config.tml0_data_channel[0]);
    systemTLM.A2 = getSensor(config.tml0_data_channel[1]);
    systemTLM.A3 = getSensor(config.tml0_data_channel[2]);
    systemTLM.A4 = getSensor(config.tml0_data_channel[3]);
    systemTLM.A5 = getSensor(config.tml0_data_channel[4]);
    systemTLM.BITS = 0;
    if (getBits(config.tml0_data_channel[5]))
        systemTLM.BITS |= 0x01;
    if (getBits(config.tml0_data_channel[6]))
        systemTLM.BITS |= 0x02;
    if (getBits(config.tml0_data_channel[7]))
        systemTLM.BITS |= 0x04;
    if (getBits(config.tml0_data_channel[8]))
        systemTLM.BITS |= 0x08;
    if (getBits(config.tml0_data_channel[9]))
        systemTLM.BITS |= 0x10;
    if (getBits(config.tml0_data_channel[10]))
        systemTLM.BITS |= 0x20;
    if (getBits(config.tml0_data_channel[11]))
        systemTLM.BITS |= 0x40;
    if (getBits(config.tml0_data_channel[12]))
        systemTLM.BITS |= 0x80;
}

String getPath(int idx)
{
    String ret = "";
    switch (idx)
    {
    case 0: // OFF
        ret = "";
        break;
    case 1: // DST-TRACE1
    case 2: // DST-TRACE2
    case 3: // DST-TRACE3
    case 4: // DST-TRACE4
        ret = "DST" + String(idx);
        break;
    case 5: // TRACE1-1
        ret = "TRACE1-1";
        break;
    case 6:
        ret = "TRACE2-2";
        break;
    case 7:
        ret = "TRACE3-3";
        break;
    case 8:
        ret = "WIDE1-1";
        break;
    case 9:
        ret = "RFONLY";
        break;
    case 10:
        ret = "RELAY";
        break;
    case 11:
        ret = "GATE";
        break;
    case 12:
        ret = "ECHO";
        break;
    case 13: // UserDefine1
        ret = String(config.path[0]);
        break;
    case 14: // UserDefine2
        ret = String(config.path[1]);
        break;
    case 15: // UserDefine3
        ret = String(config.path[2]);
        break;
    case 16: // UserDefine4
        ret = String(config.path[3]);
        break;
    default:
        ret = "WIDE1-1";
        break;
    }
    return ret;
}

char EVENT_TX_POSITION = 0;
unsigned char SB_SPEED = 0, SB_SPEED_OLD = 0;
int16_t SB_HEADING = 0;
uint16_t tx_interval = 0, igate_tx_interval, digi_tx_interval; // How often we transmit, in seconds
unsigned int tx_counter, igate_tx_counter, digi_tx_counter;    // Incremented every second
int16_t last_heading, heading_change;                          // Keep track of corner pegging
uint16_t trk_interval = 15;

void GPS_INIT()
{
    SerialGPS.begin(9600, SERIAL_8N1, config.gnss_rx_gpio, config.gnss_tx_gpio);
    SerialGPS.flush();
    while (SerialGPS.available() > 0)
        SerialGPS.read();
}

void taskGPS(void *pvParameters)
{
    unsigned long gpsTickInterval;
    GPS_INIT();
    for (;;)
    {
        vTaskDelay(100 / portTICK_PERIOD_MS);

        while (SerialGPS.available())
            gps.encode(SerialGPS.read());

        if (firstGpsTime && gps.time.isValid())
        {
            if (gps.time.isUpdated())
            {
                time_t timeGps = getGpsTime(); // Local gps time
                if (timeGps > 1653152400 && timeGps < 2347462800)
                {
                    setTime(timeGps);
                    time_t rtc = timeGps;
                    timeval tv = {rtc, 0};
                    timezone tz = {TZ_SEC + DST_MN, 0};
                    settimeofday(&tv, &tz);
#ifdef DEBUG
                    log_d("\nSET GPS Timestamp = %u Year=%d\n", timeGps, year());
#endif
                    // firstGpsTime = false;
                    firstGpsTime = false;
                    if (startTime == 0)
                        startTime = now();
                }
                else
                {
                    startTime = 0;
                }
            }
        }
    }
}

long timeSlot;
unsigned long iGatetickInterval;
bool initInterval = true;
void taskAPRS(void *pvParameters)
{
    //	long start, stop;
    char sts[50];
    // char *raw;
    // char *str;
    // unsigned long tickInterval;
    unsigned long DiGiInterval;

    Serial.println("Task APRS has been start");
    PacketBuffer.clean();

    afskSetSQL(config.rf_sql_gpio, config.rf_sql_active);
    afskSetDCOffset(config.adc_dc_offset);
    afskSetADCAtten(config.adc_atten);
    APRS_init();
    APRS_setCallsign(config.aprs_mycall, config.aprs_ssid);
    //APRS_setPath1("WIDE1-1", 1);
    APRS_setPreamble(300);
    APRS_setTail(0);
    sendTimer = millis() - (config.igate_interval * 1000) + 30000;
    igateTLM.TeleTimeout = millis() + 60000; // 1Min
    AFSKInitAct = true;
    timeSlot = millis();
    timeAprs = 0;
    afskSetHPF(config.audio_hpf);
    afskSetBPF(config.audio_bpf);
    timeSlot = millis();
    tx_counter = tx_interval - 10;
    initInterval = true;
    for (;;)
    {
        long now = millis();
        // wdtSensorTimer = now;
        time_t timeStamp;
        time(&timeStamp);
        if (initInterval)
        {
            DiGiInterval = iGatetickInterval = millis() + 10000;
            systemTLM.ParmTimeout = millis() + 20000;
            systemTLM.TeleTimeout = millis() + 30000;
            initInterval = false;
        }
        vTaskDelay(10 / portTICK_PERIOD_MS);

