nakhonthai/ESP32IGate/src/main.cpp
        // if (config.rf_en)
        { // RF Module enable
            // SEND RF in time slot
            if (now > (timeSlot + 10))
            {
                // Transmit in timeslot if enabled
                if (config.rf_sql_gpio > -1)
                { // Set SQL pin
                    if (digitalRead(config.rf_sql_gpio) ^ config.rf_sql_active)
                    { // RX State Fail
                        if (pkgTxSend())
                            timeSlot = millis() + config.tx_timeslot; // Tx Time Slot >2sec.
                        else
                            timeSlot = millis() + 3000;
                    }
                    else
                    {
                        timeSlot = millis() + 1500;
                    }
                }
                else
                {
                    if (pkgTxSend())
                        timeSlot = millis() + config.tx_timeslot; // Tx Time Slot > 2sec.
                    else
                        timeSlot = millis() + 3000;
                }
            }
        }

        //         if (digitalRead(0) == LOW)
        //         {
        //             btn_count++;
        //             if (btn_count > 1000) // Push BOOT 10sec
        //             {
        //                 digitalWrite(LED_PIN, HIGH);
        //                 digitalWrite(LED_TX_PIN, HIGH);
        //             }
        //         }
        //         else
        //         {
        //             if (btn_count > 0)
        //             {
        //                 // Serial.printf("btn_count=%dms\n", btn_count * 10);
        //                 if (btn_count > 1000) // Push BOOT 10sec to Factory Default
        //                 {
        //                     defaultConfig();
        //                     Serial.println("SYSTEM REBOOT NOW!");
        //                     esp_restart();
        //                 }
        //                 else if (btn_count > 10) // Push BOOT >100mS to PTT Fix location
        //                 {
        //                     if (config.tnc)
        //                     {
        //                         String tnc2Raw = send_fix_location();
        //                         pkgTxUpdate(tnc2Raw.c_str(), 0);
        //                         // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
        // #ifdef DEBUG_TNC
        //                         Serial.println("Manual TX: " + tnc2Raw);
        // #endif
        //                     }
        //                 }
        //                 btn_count = 0;
        //             }
        //         }

        // LOAD DATA incomming
        bool newIGatePkg = false;
        bool newDigiPkg = false;
        if (PacketBuffer.getCount() > 0)
        {
            String tnc2;
            // นำข้อมูลแพ็จเกจจาก TNC ออกจากคิว
            PacketBuffer.pop(&incomingPacket);
            // igateProcess(incomingPacket);
            packet2Raw(tnc2, incomingPacket);
            newIGatePkg = true;
            newDigiPkg = true;
#ifdef BLUETOOTH
            if (config.bt_master)
            { // Output TNC2RAW to BT Serial
              // SerialBT.println(tnc2);
                if (config.bt_mode == 1)
                {
                    char *rawP = (char *)malloc(tnc2.length());
                    memcpy(rawP, tnc2.c_str(), tnc2.length());
                    SerialBT.write((uint8_t *)rawP, tnc2.length());
                    // pTxCharacteristic->setValue((uint8_t *)rawP, tnc2.length());
                    // pTxCharacteristic->notify();
                    free(rawP);
                }
                else if (config.bt_mode == 2)
                { // KISS
                    uint8_t pkg[500];
                    int sz = kiss_wrapper(pkg);
                    SerialBT.write(pkg, sz);
                    // pTxCharacteristic->setValue(pkg, sz);
                    // pTxCharacteristic->notify();
                }
            }
#endif
            log_d("RX: %s", tnc2.c_str());

            // SerialBT.println(tnc2);
            uint16_t type = pkgType((char *)incomingPacket.info);
            char call[11];
            if (incomingPacket.src.ssid > 0)
                sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
            else
                sprintf(call, "%s", incomingPacket.src.call);

            char *rawP = (char *)malloc(tnc2.length());
            memcpy(rawP, tnc2.c_str(), tnc2.length());
            int idx = pkgListUpdate(call, rawP, type, 0);
            free(rawP);
#ifdef OLED
            if (idx > -1)
            {

                if (config.rx_display && config.dispRF && (type & config.dispFilter))
                {
                    dispBuffer.push(tnc2.c_str());
                    log_d("RF_putQueueDisp:[pkgList_idx=%d,Type=%d] %s\n", idx, type, call);
                }
            }
#endif
            lastPkg = true;
            lastPkgRaw = tnc2;
            // ESP_BT.println(tnc2);
            status.allCount++;
        }

        // IGate Process
        if (config.igate_en)
        {
            // IGATE Position
            if (config.igate_bcn)
            {
                if (millis() > iGatetickInterval)
                {

                    String rawData = "";
                    if (config.igate_gps)
                    { // IGATE Send GPS position
                        if (gps.location.isValid())
                            rawData = igate_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                    }
                    else
                    { // IGATE Send fix position
                        rawData = igate_position(config.igate_lat, config.igate_lon, config.igate_alt, "");
                    }
                    if (rawData != "")
                    {
                        iGatetickInterval = millis() + (config.igate_interval * 1000);
                        log_d("IGATE_POSITION: %s", rawData.c_str());

                        if (config.igate_gps)
                            sprintf(sts, "POSITION GPS\nINTERVAL %ds", tx_interval);
                        else
                            sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);
                        if (config.igate_loc2rf)
                        { // IGATE SEND POSITION TO RF
                            char *rawP = (char *)malloc(rawData.length());
                            // rawData.toCharArray(rawP, rawData.length());
                            memcpy(rawP, rawData.c_str(), rawData.length());
                            pkgTxPush(rawP, rawData.length(), 0);
                            pushTxDisp(TXCH_RF, "TX IGATE", sts);
                            free(rawP);
                        }
                        if (config.igate_loc2inet)
                        { // IGATE SEND TO APRS-IS
                            if (aprsClient.connected())
                            {
                                status.txCount++;
                                aprsClient.println(rawData); // Send packet to Inet
                                pushTxDisp(TXCH_TCP, "TX IGATE", sts);
                            }
                        }
                    }
                }
            }
            // IGATE send to inet
            if (newIGatePkg)
            {
                newIGatePkg = false;
                if (config.rf2inet && aprsClient.connected())
                {
                    int ret = 0;
                    uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
                    // IGate Filter RF->INET
                    if ((type & config.rf2inetFilter))
                        ret = igateProcess(incomingPacket);
                    if (ret == 0)
                    {
                        status.dropCount++;
                        igateTLM.DROP++;
                    }
                    else
                    {
                        status.rf2inet++;
                        igateTLM.RF2INET++;
                        igateTLM.TX++;
                    }
                }
            }
        }

        // Digi Repeater Process
        if (config.digi_en)
        {
            // DIGI Position
            if (config.digi_bcn)
            {
                if (millis() > DiGiInterval)
                {

